#+title: x

* Whole tree 🌴
#+begin_src fish :dir ~/ :results output verbatim :exports both
tree -L 2 -I Desktop/ -I Downloads/ -I Books/ -I Zotero/ -I dump/ -I Documents/ -I Pictures -I papers
#+end_src

#+RESULTS:
#+begin_example
.
├── faafo
│   ├── experiments
│   └── gig23
├── infra
│   ├── t
│   ├── t-base-go
│   ├── t-base-python
│   └── workshop
├── locus
│   ├── anki
│   ├── blog
│   ├── cheat
│   ├── diary
│   ├── mogoz
│   ├── o
│   └── todayi
├── notes
│   └── org
├── projects
│   ├── gigs
│   ├── oss
│   └── work
├── README.org
└── wallpaper.jpg

23 directories, 2 files
#+end_example

** Export locus
#+begin_src fish :dir ~/ :results output verbatim :tangle ~/.config/fish/functions/export_locus.fish
function export_locus --description 'export most of locus'
  pushd ~/locus
  set -l repos_to_export blog diary mogoz o todayi cheat
  for r in $repos_to_export;
      pushd $r
      echo "exporting repos ~/locus/$r"
      make export
      echo "done exporting repos ~/locus/$r"
      popd
  end
  popd
end
#+end_src

** Push things
#+begin_src fish :dir ~/ :results output verbatim :tangle ~/.config/fish/functions/push_everything.fish
function traverse_and_push
   if test -z "$argv"
       return
   end

   for repo in $argv;
    pushd $repo
    if test -d .git
        set_color green; echo "Found a git repo: $repo, will attempt pushing changes"
        set_color normal;
        git add -A
        git commit -m "auto: automated push by push_everything"
        git push origin main
    else
       set -l dirs $(ls)
       traverse_and_push $dirs
    end
    popd
   end
end

function push_everything --description 'push personal repos to gh'
    pushd ~
    set -l trees locus infra faafo
    for t in $trees;
        pushd $t
        set -l dirs $(ls)
        traverse_and_push $dirs
        popd
    end
    popd
end
#+end_src

** Workspace
#+begin_src org-mode :tangle ~/.emacs.d/.local/cache/treemacs-persist
,* Perspective wick
,** o
 - path :: ~/locus/o
,** blog
 - path :: ~/locus/blog
,** notes
 - path :: ~/notes
,** anki
 - path :: ~/locus/anki
,** .config
 - path :: ~/.config
#+end_src
